Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: The preference of the L</regular expression> engine to match the leftmost occurrence of a L</pattern>, then given a position at which a match will occur, the preference for the longest match (presuming the use of a L</greedy> quantifier).
es: La preferencia del motor de L<expresiones regulares|/expresión regular> por detectar la primera aparición de un L</patrón> empezando por la izquierda, y una vez obtenida una posición de coincidencia, la preferencia por la coincidencia más larga (se supone que se usa un cuantificador L</avaricioso>).

source: The previous assignments are exactly equivalent to
es: Las asignaciones anteriores equivalen exactamente a

source: The principle of encapsulation tells us that we should not rely on this.
es: El principio de encapsulación nos dice que no deberíamos basarnos en esta característica.

source: The private data cache will take ownership of a reference to private_sv, much the same way that C<hv_store()> takes ownership of a reference to the value that you pass it.
es: La caché de datos privada se apropiará de una referencia a private_sv, de la misma manera que C<hv_store()> asumirá la propiedad de una referencia al valor que le pase.

source: The problem here is that both the group named C<< a >> and the group named C<< b >> are aliases for the group belonging to C<< $1 >>.
es: El problema es que tanto el grupo con el nombre C<< a >> como el grupo con el nombre C<< b >> son alias del grupo perteneciente a C<< $1 >>.

source: The process of determining what method should be used is called B<method resolution>.
es: El proceso de determinar qué método debe usarse se denomina B<resolución de métodos>.

source: The process of gluing one cat's nose to another cat's tail.
es: El proceso de colar la punta de algo con la cola de otra cosa del mismo tipo.

source: The process of producing a L</string> representation of an abstract object.
es: El proceso de crear una representación en forma de L</cadena> de un objeto abstracto.

source: The program should C<close DATA> when it is done reading from it.
es: El programa debe ejecutar C<close DATA> cuando termine de leer.

source: The program that interactively gives you a prompt, accepts one or more L<lines|/line> of input, and executes the programs you mentioned, feeding each of them their proper L<arguments|/argument> and input data.
es: Es el programa que muestra un símbolo del sistema interactivo, acepta una o varias L<líneas|/línea> de entrada y ejecuta los programas especificados, cada uno con sus L<argumentos|/argumento> y datos de entrada adecuados.

source: The pseudo-hash feature was an experimental feature introduced in earlier versions of Perl and removed in 5.10.0.
es: Los seudohashes se incluyeron de forma experimental en las primeras versiones de Perl y se eliminaron en la versión 5.10.0.

source: The quality that makes you go to great effort to reduce overall energy expenditure.
es: La cualidad que nos obliga a realizar un gran esfuerzo para reducir el gasto global de energía.

source: The quickest way to get unblocked is to notify the admins.
es: La forma más rápida de conseguir que le desbloqueen es notificárselo a los administradores.

source: The rationale for requiring this is to not break older programs that rely on the way things worked before Unicode came along.
es: Esto se hace así para evitar que dejen de funcionar programas antiguos, que se basan en el funcionamiento anterior a la creación de Unicode.

source: The regression tests for each operator live in F<t/op/>, and so we make a copy of F<t/op/pack.t> to F<t/op/pack.t~>.
es: Las pruebas de regresión para cada operador se encuentran en F<t/op/>, así que hacemos una copia de F<t/op/pack.t> en F<t/op/pack.t~>.

source: The relevant place is F<pod/perlfunc.pod>; again, we make a copy, and then we'll insert this text in the description of C<pack>:
es: El lugar correspondiente es F<pod/perlfunc.pod>. Una vez más, hacemos antes una copia de seguridad y después insertamos el texto siguiente en la descripción de C<pack>:

source: The rest of the name tells you the particular value to which it refers.
es: El resto del nombre indica a qué valor concreto se accede.

source: The restriction lasts to the end of the enclosing block.
es: La restricción dura hasta el final del bloque en que se encuentre.

source: The result of evaluation is considered a regular expression and matched as if it were inserted instead of this construct.
es: El resultado de la evaluación se considera una expresión regular y se compara como si estuviera insertada en lugar de esta construcción.

source: The result is unpredictable and will make perl unstable.
es: El resultado es impredecible y hará que perl sea inestable.

source: The results end up in C, C and so on.
es: Los resultados se almacenan en C, C, etc.

source: The results of creating new symbol table entries directly or modifying any entries that are not already typeglobs are undefined and subject to change between releases of perl.
es: El resultado de crear directamente nuevas entradas en la tabla de símbolos o de modificar cualquier entrada que no sea ya un I<typeglob> no está definido y puede estar sujeto a cambios entre versiones de Perl.

source: The return code from the filter is ignored.
es: Se omite el código de retorno del filtro.

source: The routines use a dynamic hashing scheme to locate any entry with only two disk accesses.
es: Las rutinas usan un esquema de hash dinámico para localizar cualquier entrada con solo dos accesos al disco.

source: The rules for this are different for lower-level loops given by the greedy quantifiers C<*+{}>, and for higher-level ones like the C</g> modifier or split() operator.
es: Las reglas que usa son distintas de las de los bucles de bajo nivel proporcionados por los cuantificadores avariciosos C<*+{}> y para los de más alto nivel, como el modificador C</g> o el operador split().

source: The rules of conduct that, in the absence of other guidance, determine what should happen first.
es: Las normas de conducta que, en ausencia de otros criterios, determinan qué debe suceder primero.

source: The scope of the package declaration is from the declaration itself through the end of the enclosing block, C<eval>, or file, whichever comes first (the same scope as the my() and local() operators).
es: El ámbito de la declaración de paquete abarca desde la declaración misma hasta el final del bloque, de la función C<eval> o del archivo actuales, lo que aparezca antes (es el mismo ámbito que el de los operadores my() y local()).

source: The search engine will initially match C<\D*> with "ABC".
es: El motor de búsqueda asocia inicialmente C<\D*> con "ABC".

source: The second case does not, and would have to be specified literally.
es: En el segundo caso no es así, y debe especificarse de forma literal.

source: The second form is strongly discouraged, because it breaks the ability of a subclass to reuse the parent's constructor, but you may still run across it in existing code.
es: La segunda forma se desaconseja rotundamente, ya que impide que la subclase reutilice el constructor de la clase primaria, pero aún se puede ver en código existente.

source: The second one is C<users.perl5.git.perl.org> (I<dromedary>), which can be used for general testing and development.
es: El otro es C<users.perl5.git.perl.org> (I<dromedary>), que se puede usar para pruebas y desarrollo general.

source: The services a piece of code promises to provide forever, in contrast to its L</implementation>, which it should feel free to change whenever it likes.
es: Los servicios que un componente de código debe mantener para siempre, a diferencia de su L</implementación>, que se puede modificar siempre que sea necesario.

source: The similarity to the title of the major Perl book (which came later) is not completely accidental:
es: La similitud con el título del libro principal de Perl (que se publicó posteriormente) no es totalmente accidental:

source: The simplest way to create a remote topic branch that works on all versions of git is to push the current head as a new branch on the remote, then check it out locally:
es: La forma más sencilla de crear una rama puntual remota que funcione en todas las versiones de git es enviar la rama de encabezado actual como nueva rama en el repositorio remoto y después obtener una copia local:

source: The situation in which an L</expression> is expected by its surroundings (the code calling it) to return a list of values rather than a single value.
es: Situación en la que el entorno de una L</expresión> (el código que la llama) espera que esta devuelva una lista de valores, en lugar de un solo valor.

source: The situation in which an L</expression> is expected by its surroundings (the code calling it) to return a single L</value> rather than a L</list> of values.
es: Situación en la que el entorno de una L</expresión> (el código que la llama) espera que esta devuelva un solo L</valor>, en lugar de una L</lista> de valores.

source: The situation in which an expression is expected by its surroundings (the code calling it) to return a L</string>.
es: Situación en la que el entorno de una expresión (es decir, el código que la llama) espera que devuelva una L</cadena>.

source: The situation in which an expression is expected by its surroundings (the code calling it) to return a number.
es: Situación en la que el entorno de una expresión (el código que la llama) espera que esta devuelva un número.

source: The size of the pieces you're dealing with, mentally speaking.
es: El tamaño de los elementos con los que se trabaja (de forma abstracta).

source: The smallest possible unit of information storage.
es: La unidad de almacenamiento de información más pequeña posible.

source: The socket tests may fail if the network is not configured.
es: Si la red no está configurada, las pruebas de sockets pueden generar errores.

source: The special literals __FILE__, __LINE__, and __PACKAGE__ represent the current filename, line number, and package name at that point in your program.
es: Los literales especiales __FILE__, __LINE__ y __PACKAGE__ representan el nombre del archivo, el número de línea y el nombre del paquete actuales en ese punto del programa.

source: The special mark that tells the operating system it can run this program.
es: Marca especial que indica al sistema operativo que puede ejecutar este programa.

source: The special symbol C<__PACKAGE__> contains the current package, but cannot (easily) be used to construct variable names.
es: El símbolo especial C<__PACKAGE__> contiene el paquete actual, pero no puede usarse (fácilmente) para crear nombres de variables.

source: The special variable C<$#array> tells you the index of the last element of an array:
es: La variable especial C<$#array> indica el índice del último elemento de un array:

source: The stability of these extensions varies widely.
es: La estabilidad de estas extensiones varía mucho.

source: The standard but antiquated F<dumpvar.pl> library and the CPAN module Devel::Symdump make use of this.
es: La biblioteca estándar (aunque anticuada) F<dumpvar.pl> y el módulo Devel::Symdump de CPAN lo usan.

source: The standard release of Perl (the one maintained by the Perl development team) is distributed only in source code form.
es: La versión estándar de Perl (la mantenida por el equipo de desarrollo de perl) sólo se distribuye en forma de código fuente.

source: The startup and import code of any L<use|perlfunc/use> declaration is also run during compile phase.
es: El código de inicio e importación de cualquier declaración L<use|perlfunc/use> también se ejecuta durante la fase de compilación.

source: The state information in C<%^H> is stored in the optree, and can be retrieved read-only at runtime with C<caller()>, at index 10 of the list of returned results.
es: La información de estado de C<%^H> se almacena en el árbol sintáctico de operaciones y se puede recuperar como información de solo lectura en tiempo de ejecución mediante C<caller()>, en el índice 10 de la lista de resultados devueltos.

source: The string index to a L</hash>, used to look up the L</value> associated with that key.
es: Cadena de índice de un L</hash> que se usa para buscar el L</valor> asociado con esa clave.

source: The subtle but sometimes brutal art of attempting to turn your possibly malformed program into a valid L</syntax tree>.
es: El arte sutil, y a veces brutal, de intentar convertir un programa posiblemente mal escrito en un L</árbol de sintaxis> válido.

source: The superuser (UID == 0).
es: El superusuario (UID == 0).

source: The surroundings, or environment.
es: El entorno (o los alrededores).

source: The switches above deserve explanation.
es: A continuación se describen estos modificadores.

source: The symbol C<$Ent::moot> is qualified; C<$moot> is unqualified.
es: El símbolo C<$Ent::moot> es completo; C<$moot> no es completo.

source: The symbol table for a package happens to be stored in the hash of that name with two colons appended.
es: La tabla de símbolos de un paquete se almacena en el hash cuyo nombre es el nombre del paquete con un doble signo de dos puntos anexado.

source: The syntactic position falling between a method call and its arguments when using the indirect object invocation syntax.
es: La posición sintáctica situada entre una llamada a método y sus argumentos, cuando se usa la sintaxis indirecta de invocación de objetos.

source: The syntax for encoding text strings to binary strings is as simple as decoding:
es: La sintaxis para codificar cadenas de texto en cadenas binarias es tan sencilla como la sintaxis de descodificación:

source: The syntax for most of these is a pair of parentheses with a question mark as the first thing within the parentheses.
es: La sintaxis, para la mayor parte de estos casos, es un par de paréntesis con un signo de interrogación como primer elemento dentro de los paréntesis.

source: The system being designed is large, or is likely to become large.
es: El sistema que se está diseñando es grande o puede llegar a serlo.

source: The system design is already object-oriented.
es: El diseño del sistema ya es orientado a objetos.

source: The term "native" does not mean quite as much when we talk about native integers, as it does when native floating point numbers are involved.
es: En el caso de los enteros nativos, el término "nativo" no tiene las mismas implicaciones que para los números de punto flotante nativos.

source: The text is ignored.
es: Se ignora el texto.

source: The thing that gives this away is the fact that you can have B<more than one> of these code blocks in a program, and they will get B<all> executed at the appropriate moment.
es: Esto es así porque se puede incluir B<más de uno> de estos bloques de código en un programa y B<todos> ellos se ejecutarán en el momento adecuado.

source: The three primary contexts are L</list context>, L</scalar context>, and L</void context>.
es: Los tres tipos de contexto principales son L</contexto de lista>, L</contexto escalar> y L</contexto vacío>.

source: The three principal virtues of a programmer are Laziness, Impatience, and Hubris.
es: Las tres virtudes principales de un buen programador son la pereza, la impaciencia y la confianza en sí mismo.

source: The time when Perl is actually doing what your code says to do, as opposed to the earlier period of time when it was trying to figure out whether what you said made any sense whatsoever, which is L</compile time>.
es: El tiempo en el que Perl hace lo que el código dice, en contraste con el periodo de tiempo anterior, en el que intentaba averiguar si lo que el programa decía tenía sentido (el L</tiempo de compilación>).

source: The time when Perl is trying to make sense of your code, as opposed to when it thinks it knows what your code means and is merely trying to do what it thinks your code says to do, which is L</run time>.
es: Tiempo en el que Perl intenta entender el código, en contraste con el L</tiempo de ejecución>, que es el tiempo en que piensa que ya lo entiende y simplemente intenta ejecutar las instrucciones del código.

source: The treatment of more than one physical L</line> as a single logical line.
es: Tratar más de una L</línea> física como una sola línea lógica.

source: The tutorial and FAQ assume the latest release.
es: En el tutorial y en las preguntas más frecuentes se supone que usa la versión más reciente.

source: The tutorial started in the Llama continues in the Alpaca, which introduces the intermediate features of references, data structures, object-oriented programming, and modules:
es: El tutorial iniciado en el Libro de la Llama continúa en el Libro de la Alpaca, que presenta material de nivel intermedio, como referencias, estructuras de datos, programación orientada a objetos y módulos:

source: The tutorial uses UTF-8 consistently, even where utf8 is actually used internally, because the distinction can be hard to make, and is mostly irrelevant.
es: En este tutorial se usa siempre UTF-8, incluso para los casos en que se use utf8 internamente, ya que esta distinción puede resultar difícil de apreciar y además suele ser irrelevante.

source: The two additional lines request from perl to catch various common problems in your code.
es: Estas dos líneas adicionales ordenan a perl que detecte diversos problemas comunes en el código.

source: The two branches of a C<(?(condition)yes-pattern|no-pattern)> do not count as an alternation, as far as C<(*THEN)> is concerned.
es: En lo que se refiere a C<(*THEN)>, las dos ramas de C<(?(condición)patrón-sí|patrón-no)> no cuentan como una alternativa.

source: The two control characters ^D and ^Z, and the tokens __END__ and __DATA__ may be used to indicate the logical end of the script before the actual end of file.
es: Se pueden usar los dos caracteres de control ^D y ^Z, y los símbolos __END__ y __DATA__, para indicar el final lógico del programa antes del final real del archivo.

source: The two statements:
es: Las dos instrucciones

source: The type of bracket (square or curly) governs whether it's an array or a hash being looked at.
es: el tipo de delimitador (corchete o llave) indica si se trata de un array o un hash.

source: The type prefix of a typeglob is a C<*>, because it represents all types.
es: El prefijo de tipo de un typeglob es C<*>, ya que representa todos los tipos.

source: The typical C compiler's first pass, which processes lines beginning with C<#> for conditional compilation and macro definition and does various manipulations of the program text based on the current definitions.
es: El primer barrido típico del compilador de C, que procesa las líneas que empiezan por C<#> para compilación condicional y definición de macros, y que manipula de varias maneras el texto del programa basándose en las definiciones actuales.

source: The typical input/output flow of a program is:
es: El flujo de entrada/salida típico de un programa es:

source: The typical interactions between pieces of data are best represented by operators.
es: Las interacciones típicas entre elementos de datos se representan mejor mediante operadores.

source: The undefined version is the value that indicates that there is no real value for something, such as when there was an error, or at end of file, or when you refer to an uninitialized variable or element of an array or hash.
es: La versión indefinida es el valor que indica que no existe ningún valor real para algo, como cuando se produce un error, se alcanza el final de un archivo, o cuando se hace referencia a una variable o un elemento de array o hash no inicializados.

source: The upshot of all this is that Perl cannot store a number like 12345678901234567 as a floating point number on such architectures without loss of information.
es: Como consecuencia, Perl no puede almacenar un número como 12345678901234567 en forma de número de punto flotante para estas arquitecturas sin pérdida de información.

source: The use of C<\K> inside of another look-around assertion is allowed, but the behaviour is currently not well defined.
es: El uso de C<\K> dentro de otra aserción de inspección está permitido, pero su comportamiento aún no está bien definido.

source: The use of parentheses around a L</subpattern> in a L</regular expression> to store the matched L</substring> as a L</backreference> or L<capture group|/capture buffer, capture group>.
es: Escribir un L</subpatrón> entre paréntesis en una L</expresión regular> para almacenar la L</subcadena> detectada como una L</retrorreferencia> o un L<grupo de captura|/búfer de captura, grupo de captura>.

source: The use of these variables incurs no global performance penalty, unlike their punctuation char equivalents, however at the trade-off that you have to tell perl when you want to use them.
es: El uso de estas variables no implica una penalización en el rendimiento global, a diferencia de sus predecesoras, pero a cambio requieren que indique a perl que desea utilizarlas.

source: The user simply calls documented methods on the object.
es: El usuario únicamente llama a los métodos documentados del objeto.

source: The usual C-style backslash rules apply for making characters such as newline, tab, etc., as well as some more exotic forms.
es: Se aplican las reglas normales de barra diagonal inversa estilo C para crear caracteres como el salto de línea, tabulaciones, etc., y algunas formas más exóticas.

source: The value in each entry of the hash is what you are referring to when you use the C<*name> typeglob notation.
es: Usamos la notación C<*nombre> para hacer referencia al valor de cada entrada del hash.

source: The value is passed direct as the parameter I<kflags> to C<hv_common()>.
es: El valor se pasa directamente como el parámetro I<kflags> a C<hv_common()>.

source: The value of a character (C<ord>, C<chr>) is the corresponding Unicode code point.
es: El valor de un carácter (C<ord>, C<chr>) es el código de carácter Unicode correspondiente.

source: The value of an attribute may itself be another object.
es: El valor de un atributo puede ser a su vez otro objeto.

source: The variables are scoped to the block (i.e. a bunch of statements surrounded by curly-braces) in which they are defined.
es: El ámbito de las variables es el bloque (conjunto de instrucciones entre llaves) en el que se definen.

source: The various types of data aggregate form a natural hierarchy that facilitates the use of inheritance and polymorphism.
es: Los distintos tipos de datos agregados forman una jerarquía natural que facilita el uso de la herencia y el polimorfismo.

source: The veil of abstraction separating the L</interface> from the L</implementation> (whether enforced or not), which mandates that all access to an L</object>'s state be through L<methods|/method> alone.
es: El velo de abstracción que separa la L</interfaz> de la L</implementación> (tanto si se fuerza como si no), que ordena que todo el acceso al estado de un L</objeto> sea solo a través de L<métodos|/método>.

source: The wandering prose riddled with jargon is hard to fathom in several places.
es: Las digresiones de la prosa y la gran cantidad de jerga hacen que cueste entender algunos puntos.

source: The way a program responds to an error.
es: La forma en que un programa responde a un error.

source: The word is also used as a nickname for a L</switch statement>.
es: "Switch" es un alias de la L</instrucción switch>.

source: The word returned by the L<ref|perlfunc/ref> function when you apply it to a reference to a subroutine.
es: La palabra devuelta por la función L<ref|perlfunc/ref> cuando se aplica a una referencia a una subrutina. Significa "código".
